tutorials/waveFoamGABC/curvedChannel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (10.0  0.0  -0.50)
    (14.0  0.0  -0.50)
    ( 0.0 14.0  -0.50)
    ( 0.0 10.0  -0.50)

    (10.0  0.0   0.20)
    (14.0  0.0   0.20)
    ( 0.0 14.0   0.20)
    ( 0.0 10.0   0.20)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (30 200 25) simpleGrading (1 1 1)
);

edges           
(
    arc 3 0 (7.07107 7.07107 -0.5)
    arc 1 2 (9.89949 9.89949 -0.5)
    arc 7 4 (7.07107 7.07107  0.2)
    arc 5 6 (9.89949 9.89949  0.2)
);

patches         
(
    patch inlet
    (
        (0 1 5 4)
    )
    patch bottom 
    (
        (0 1 2 3)
    )
    patch outlet
    (
        (3 2 6 7)
    )

    patch atmosphere 
    (
        (4 5 6 7)
    )
    
    patch back
    (
        (3 0 4 7)
    )

    patch front
    (
        (1 5 6 2)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
